tests/integration/convection/galinat2D/constant/polyMesh/blockMeshDict
// vim: ts=4 sw=4 ai cindent syntax=lua
/*--------------------------------*- C++ -*----------------------------------*
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.03;

vertices
(
    (0 0.25 -0.1)
    (14 0.25 -0.1)
    (14 0.5 -0.1)
    (0 0.5 -0.1)
    (0 0.25 0)
    (14 0.25 0)
    (14 0.5 0)
    (0 0.5 0)
    (0 -0.25 -0.1)
    (14 -0.25 -0.1)
    (0 -0.25 0)
    (14 -0.25 0)
    (0 -0.5 -0.1)
    (14 -0.5 -0.1)
    (0 -0.5 0)
    (14 -0.5 0)
    (14.1667 0.25 -0.1)
    (14.1667 0.5 -0.1)
    (14.1667 0.25 0)
    (14.1667 0.5 0)
    (14.1667 -0.25 -0.1)
    (14.1667 -0.25 0)
    (14.1667 -0.5 -0.1)
    (14.1667 -0.5 0)
    (30.1667 0.25 -0.1)
    (30.1667 0.5 -0.1)
    (30.1667 0.25 0)
    (30.1667 0.5 0)
    (30.1667 -0.5 -0.1)
    (30.1667 -0.5 0)
    (30.1667 -0.25 -0.1)
    (30.1667 -0.25 0)
);
edges
(
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (140 10 1) simpleGrading (1 1 1)
    hex (8 9 1 0 10 11 5 4) (140 30 1) simpleGrading (1  1 1)
    hex (12 13 9 8 14 15 11 10) (140 10 1) simpleGrading (1 1 1)
    hex (9 20 16 1 11 21 18 5) (5 30 1) simpleGrading (1 1 1)
    hex (16 24 25 17 18 26 27 19) (200 9 1) simpleGrading (5 3 1)
    hex (20 30 24 16 21 31 26 18) (200 30 1) simpleGrading (5  1 1)
    hex (22 28 30 20 23 29 31 21) (200 9 1) simpleGrading (5 0.333333 1)
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
         (24 25 27 26)
         (30 24 26 31)
         (28 30 31 29)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 8 10 4)
            (3 0 4 7)
            (8 12 14 10)
        );
    }
    walls
    {
        type wall;
        faces
        (
             (3 2 6 7)
             (1 2 6 5)
             (16 1 5 18)
             (16 18 19 17)
             (25 17 19 27)
             (13 12 14 15)
             (13 9 11 15)
             (9 20 21 11)
             (22 23 21 20)
             (22 28 29 23)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
             (0 3 2 1)
             (8 0 1 9)
             (12 8 9 13)
             (5 6 7 4)
             (11 5 4 10)
             (15 11 10 14)
             (9 1 16 20)
             (11 21 18 5)
             (16 17 25 24)
             (20 16 24 30)
             (22 20 30 28)
             (26 27 19 18)
             (21 31 26 18)
             (23 29 31 21)
        );
    }
);
